"""
if语句格式
if 条件表达式:
    .......(逻辑执行语句前有四个空格缩进)
"""

age = 23

if age >= 18:
    print("你已经成年了")
    print("即将步入大学生活")

print("时间过得真快啊")


"""
if else语句格式
if 条件表达式:
    .......(逻辑执行语句前有四个空格缩进)
    .......
    .......
else:
    .......
    .......
"""


"""
if elif else语句
 if 条件1：
    ......
    ......
 elif 条件2:
    ......
    ......
 elif 条件n:
    ......
    ......
 else:
    ......
    ......
"""


"""
判断语句的嵌套
if 条件1:
    ......
    ......
    
    if 条件2:
        ......
        ......
        
嵌套关键点在于--缩进
"""

