"""
演示Python中的各种运算符
"""
# 算数（数学）运算符：
# +   加
print("1 + 1 = ", 1 + 1)
# -   减
print("3 - 1 = ", 3 - 1)
# *   乘
print("4 * 1 = ", 4 * 1)
# /   除
print("2 / 1 = ", 2 / 1)
# %   取余
print("10 % 3 = ", 10 % 3)
# **  求幂
print("10 ** 3 = ", 10 ** 3)
# //  取整除
print("14 // 3 = ", 14 // 3)

# 赋值运算符：
# =  赋值
a = 10

# 复合赋值运算符：
# +=  自增
a += 1
print(a)
# -=  自减
a -= 1
print(a)
#  *=  自乘
a *= 1
print(a)
#  /=  自除
a /= 1
print(a)
#  %=  取余
a %= 4
print(a)
#  **=  求幂
a **= 2
print(a)
#  //=  取整除
a //= 3
print(a)

# 运算符优先级：
# 1. ()
# 2. **
# 3. * / // %
# 4. + -
# 5. =
# 6. 逻辑运算符
# 7. 比较运算符
# 8. 赋值运算符
# 9. 逻辑运算符