"""
序列即：列表、元组、字符串均支持进行切片操作
    切片：从一个序列中，取出一个子序列
    语法：序列[起始下表:结束下标:步长]
    注意：1、切片结果不含结束下标对应的元素
         2、结束下标留空时能取到最后一个
         3、步长N表示，每次跳过N-1个元素取
         4、步长为负数表示，反向取
         5、此操作不会影响序列本身，而会得到一个新的序列
"""
my_list = [1,2,3,4,5,6,7,8,9,10]
print(my_list[1:5])         # 步长默认为1，可以省略不写

my_tuple = (1,2,3,4,5,6,7,8,9,10)
print(my_tuple[::2])

my_str = "Hello World"
print(my_str[2::3])

my_str = "012345678"
print(my_str[::-1])    # 相当于倒序

my_list = [1,2,3,4,5,6,7,8,9,10]
print(my_list[3:1:-1])

my_tuple = (1,2,3,4,5,6,7,8,9,10)
print(my_tuple[::-2])
